# StairsTrisertypeRightNosing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTrisertypeRightNosing Property
ParameterTypeId Class See Also
---
"Right Nosing": (OBSOLETE)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTrisertypeRightNosing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTrisertypeRightNosing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTrisertypeRightNosing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace